# 第六课 数据分析工具Pandas高阶
## 第八节 数据规整 (2) -- 数据连接 merge

In [1]:
import pandas as pd
import numpy as np

In [2]:
# 创建dataframe
staff_df = pd.DataFrame([{'姓名': '张三', '部门': '研发部'},
                        {'姓名': '李四', '部门': '财务部'},
                        {'姓名': '赵六', '部门': '市场部'}])


student_df = pd.DataFrame([{'姓名': '张三', '专业': '计算机'},
                        {'姓名': '李四', '专业': '会计'},
                        {'姓名': '王五', '专业': '市场营销'}])

In [3]:
staff_df

   姓名   部门
0  张三  研发部
1  李四  财务部
2  赵六  市场部

In [4]:
student_df

     专业  姓名
0   计算机  张三
1    会计  李四
2  市场营销  王五

* 连接操作

In [5]:
# 外连接
pd.merge(staff_df, student_df, how='outer', on='姓名')
# 或者
# staff_df.merge(student_df, how='outer', on='姓名')

   姓名   部门    专业
0  张三  研发部   计算机
1  李四  财务部    会计
2  赵六  市场部   NaN
3  王五  NaN  市场营销

In [6]:
# 内连接
pd.merge(staff_df, student_df, how='inner', on='姓名')
# 或者
# staff_df.merge(student_df, how='inner', on='姓名')

   姓名   部门   专业
0  张三  研发部  计算机
1  李四  财务部   会计

In [7]:
# 左连接
pd.merge(staff_df, student_df, how='left', on='姓名')
# 或者
# staff_df.merge(student_df, how='left', on='姓名')

   姓名   部门   专业
0  张三  研发部  计算机
1  李四  财务部   会计
2  赵六  市场部  NaN

In [8]:
# 右连接
pd.merge(staff_df, student_df, how='right', on='姓名')
# 或者
# staff_df.merge(student_df, how='right', on='姓名')

   姓名   部门    专业
0  张三  研发部   计算机
1  李四  财务部    会计
2  王五  NaN  市场营销

In [14]:
# 添加新的数据列
staff_df['地址'] = ['天津', '北京', '上海']
student_df['地址'] = ['天津', '上海', '广州']

In [15]:
staff_df

   姓名   部门  地址
0  张三  研发部  天津
1  李四  财务部  北京
2  赵六  市场部  上海

In [16]:
student_df

     专业  姓名  地址
0   计算机  张三  天津
1    会计  李四  上海
2  市场营销  王五  广州

In [17]:
# 处理重复列名
# 如果两个数据中包含有相同的列名（不是要合并的列）时，merge会自动加后缀作为区别
pd.merge(staff_df, student_df, how='left', left_on='姓名', right_on='姓名')

   姓名   部门 地址_x   专业 地址_y
0  张三  研发部   天津  计算机   天津
1  李四  财务部   北京   会计   上海
2  赵六  市场部   上海  NaN  NaN

* 按索引连接

In [18]:
# 设置"姓名"为索引
staff_df.set_index('姓名', inplace=True)
student_df.set_index('姓名', inplace=True)

In [19]:
staff_df

     部门  地址
姓名
张三  研发部  天津
李四  财务部  北京
赵六  市场部  上海

In [20]:
student_df

      专业  地址
姓名
张三   计算机  天津
李四    会计  上海
王五  市场营销  广州

In [21]:
pd.merge(staff_df, student_df, how='left', left_index=True, right_index=True)
# 或者
# staff_df.merge(student_df, how='left', left_index=True, right_index=True)

     部门 地址_x   专业 地址_y
姓名
张三  研发部   天津  计算机   天津
李四  财务部   北京   会计   上海
赵六  市场部   上海  NaN  NaN